RIET/src/Reports/ПокупнаяСтоимостьТаможенныхТоваров/ПокупнаяСтоимостьТаможенныхТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПокупнаяСтоимостьТаможенныхТоваров</name>
</mdclass:Report>

RIET/src/Documents/BatchesOfCustomsFiles/BatchesOfCustomsFiles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BatchesOfCustomsFiles</name>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>SoldTo</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬSakhalin</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CCDs</name>
    <attributes>
      <name>CCD</name>
      <type>
        <types>DocumentRef.ГТД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CustomsFilesOfTemporaryImportExport</name>
    <attributes>
      <name>CustomsFile</name>
      <type>
        <types>DocumentRef.ГТД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТПО</name>
    <attributes>
      <name>ТПО</name>
      <type>
        <types>DocumentRef.CustomsFilesLight</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CustomsBonds</name>
    <attributes>
      <name>CustomsBond</name>
      <type>
        <types>DocumentRef.CustomsFilesLight</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CustomsBondClosings</name>
    <attributes>
      <name>CustomsBondClosing</name>
      <type>
        <types>DocumentRef.CustomsFilesLight</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Reports/ПокупнаяСтоимостьТаможенныхТоваров/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтруктураНастройки") Тогда
		
		СтруктураНастройки = Параметры.СтруктураНастройки;
		Если СтруктураНастройки.Имя = "ОткрытиеИзBatchOfCustomsFiles" Тогда
			НастроитьДляОткрытияИзBatchOfCustomsFiles(СтруктураНастройки);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура НастроитьДляОткрытияИзBatchOfCustomsFiles(СтруктураНастройки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("BatchOfCustomsFiles", СтруктураНастройки.BatchOfCustomsFiles);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	BatchesOfCustomsFilesCustomsFiles.CCD КАК CustomsFile
		|ИЗ
		|	Документ.BatchesOfCustomsFiles.CCDs КАК BatchesOfCustomsFilesCustomsFiles
		|ГДЕ
		|	BatchesOfCustomsFilesCustomsFiles.Ссылка = &BatchOfCustomsFiles";
		
	CustomsFiles = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("CustomsFile");
	
	Параметры.Отбор.Вставить("CCD", CustomsFiles);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	// Если установлены дополнительные отборы - то пользовательские настройки надо снять
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Количество() Тогда	
		CustomsСервер.ОтменитьИспользованиеПараметровИОтборовВПользовательскихНастройках(Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы);		
	КонецЕсли;
	
КонецПроцедуры
